{"document": {"firstName": "Brandon", "lastName": "Mosher", "header": {"position": "Software Engineer", "address": "Brooklyn, NY", "email": "brandon@mosher.xyz", "homepage": "brandon.mosher.xyz", "github": "brandonmosher", "linkedin": "brandondmosher"}, "cv": {"summary": {"title": "Summary", "cvparagraph": "I am a former U.S. Navy Cryptologic Technician Chief Petty Officer turned software engineer and physicist. I have over a decade of experience leading teams, conducting intelligence analysis, troubleshooting complex software systems, and coding solutions in high-pressure operational environments. My technical skills, which include computer architecture, embedded systems, server infrastructure, APIs, user interfaces, data analytics, and DevOps, span the entire stack. My interest areas include government efficiency and transparency, logistics, defense, cyber security, transportation, infrastructure, medicine, and environmental sustainability."}, "experience": {"title": "Work Experience", "titledItems": [], "cventries": [{"jobTitle": "Non-Commissioned Officer in Charge", "organization": "U.S. Navy Reserves, National Security Agency", "location": "Overseas", "startDate": "Sep. 2019", "endDate": "Sep. 2020", "cvitems": ["Led joint military intelligence cell providing strategic and tactical reports, threat warning, combat operation support, and crisis response.", "Developed highly effective operating procedures and techniques which were adopted by regional and national counterparts.", "Authored Python packages providing compliant automatation of mission-critical analytic workflows, increasing processing capacity 50%.", "Developed custom HTML5 front-end, providing real-time tracking of resource allocation, for SharePoint-based scheduling application.", "Architected software infrastructure enabling seamless collaboration between regional entities, decreasing incident response time.", "Awarded Joint Service Commendation Medal."]}, {"jobTitle": "Operations Leading Chief Petty Officer", "organization": "U.S. Navy Reserves", "location": "United States", "startDate": "Sep. 2017", "endDate": "Sep. 2019", "cvitems": ["Managed $300,000 training budget; coordinated travel, clearance investigation, polygraph, and facility and information systems access.", "Developed SharePoint web application to coordinate regional remote distributed operations, increasing productivity 500%.", "Developed SharePoint web application to streamline personnel security document workflows, decreasing processing time 50%.", "Awarded Navy Achievement Medal."]}, {"jobTitle": "Cryptologic Language Analyst; Full-Time Student", "organization": "U.S. Navy Reserves, University of Michigan", "location": "United States", "startDate": "Sep. 2014", "endDate": "Sep. 2017", "cvitems": ["Built roster, organizational chart, training tracker, and newsletter web applications, streamlining unit administration and communication.", "Full-time engineering student at the University of Michigan, pursuing degrees in Computer Science and Physics."]}, {"jobTitle": "Assistant Non-Commissioned Officer in Charge, Cryptologic Language Analyst", "organization": "U.S. Navy, National Security Agency", "location": "United States", "startDate": "Sep. 2011", "endDate": "Sep. 2014", "cvitems": ["Qualified in Levantine, Iraqi, and Egyptian Arabic dialects at ACTFL advanced and superior levels.", "Set standards for, trained, and oversaw analysts providing time-sensitive and strategic reporting to tactical and executive decision-makers.", "Led transition from in-house, mission-critical geospatial analysis tool to COTS alternative, authoring Python extensions to sustain/enhance capabilities which resulted in zero downtime and 20% reduced latency.", "Rapidly prototyped over 50 Python, SharePoint, and VBA applications to automate emergent analytic and administrative mission needs.", "Audited Navy warfare qualification standard, resolving over 150 errors. Organized major training events, increasing qualifications 15%.", "Awarded Joint Service Commendation medal, Flag Letter of Commendation (x3), Junior Sailor of the Quarter, and NSA Star award."]}]}, "education": {"title": "Education", "cventries": [{"degrees": ["Bachelor of Science in Engineering, Computer Science", "Bachelor of Science in Engineering, Physics"], "institution": "University of Michigan", "location": "Ann Arbor, MI", "endDate": "Dec. 2020", "cvitems": ["Relevant Coursework: Operating Systems, Robotics, Microprocessor/Logic Design, Embedded Systems, Security, Algorithms, and Data Structures. Theoretical Statistics, Probability, and Linear Algebra. Electricity/Magnetism, Mechanics, Thermodynamics, and Quantum Physics."]}, {"degrees": ["Associate of Arts with Honors, Arabic-Modern Language"], "institution": "Defense Language Institute", "location": "Monterey, CA", "endDate": "Jun. 2010", "cvitems": ["Achieved maximum possible score on Defense Language Proficiency Test halfway though the 18-month course.", "Selected for, and completed, one-month language immersion at the International Language Institute in Cairo, Egypt."]}]}, "skillsets": {"title": "Skills", "cventries": [{"title": "Programming", "skills": [{"title": "C, C++", "proficiencyPercentage": "70"}, {"title": "Javascript ES6+", "proficiencyPercentage": "80"}, {"title": "Python", "proficiencyPercentage": "80"}, {"title": "VBA"}, {"title": "ARM Asembly"}, {"title": "LaTex"}, {"title": "SQL"}, {"title": "Object-oriented design"}, {"title": "ARM ASM", "proficiencyPercentage": "65"}]}, {"title": "DevOps", "skills": [{"title": "AWS"}, {"title": "Google Cloud"}, {"title": "Docker"}, {"title": "Git"}, {"title": "Linux", "proficiencyPercentage": "70"}]}, {"title": "Back-end", "skills": [{"title": "REST API"}, {"title": "node.js"}, {"title": "Socket Programming"}]}, {"title": "Front-end", "skills": [{"title": "HTML5, CSS3", "proficiencyPercentage": "80"}, {"title": "React"}, {"title": "SharePoint"}]}, {"title": "Logic Design", "skills": [{"title": "Verilog", "proficiencyPercentage": "70"}, {"title": "FPGAs"}, {"title": "Synopsys VCS"}]}, {"title": "Languages", "skills": [{"title": "English (native); Modern Standard, Levantine, Egyptian, and Iraqi Arabic (professional working proficiency)"}]}]}, "projects": {"title": "Projects", "cventries": [{"title": "Personal Website", "url": "https://brandon.mosher.xyz", "organization": "", "date": "2021", "cvparagraph": "High-performance website written in vanilla ES6+ JavaScript, HTML5, and CSS3. Built with npm, bundled with Webpack. Continuous integration and deployment via GitHub and Nginx Docker container on GCP. Serverless contact form via Simple Email Service on AWS.", "gitHubRepoName": "brandonmosher/website"}, {"title": "Professional", "url": "https://github.com/brandonmosher/professional", "organization": "", "date": "2021", "cvparagraph": "My personal resume and coverletter adapted from posquit0's Awesome-CV. The json_to_tex Python package generates tex documents from arbitrary JSON data and a tex template with matching hierarchical structure and value placeholder macros. Tailored document versions can be generated using tags or an ordered set of JSON mixins. Build infrastructure keeps source, includes, and artifacts separate. Dockerfile and Visual Studio Code configuration included for a no-hassle tex environment.", "gitHubRepoName": "brandonmosher/professional"}, {"title": "Secure Multithreaded File Server", "url": "", "organization": "University of Michigan", "date": "2020", "cvparagraph": "Multithreaded file server capable of safely handling concurrent requests from one or more users. Implemented server using linux sockets featuring password authentication and AES encryption. Implemented file system and server API to perform CRUD operations.", "gitHubRepoName": ""}, {"title": "Operating System Pager", "url": "", "organization": "University of Michigan", "date": "2020", "cvparagraph": "Pager written in C++. Implemented process virtual address space, allocation of swap and file-backed pages, loading/evicting pages to/from physical memory, and fork with shared, swap-backed pages.", "gitHubRepoName": ""}, {"title": "Thread Library", "url": "", "organization": "University of Michigan", "date": "2020", "cvparagraph": "User thread library for linux written in C++. Implemented multi-processor support, threads, mutexes, and conditional variables.", "gitHubRepoName": ""}, {"title": "Lifesize Pacman", "url": "https://drive.google.com/drive/folders/17rF1uKOLnCBRHLGBaE6ZqqsGw5RSQBDj", "organization": "University of Michigan", "date": "2019", "cvparagraph": "Two-wheeled, light-seeking robot on LED pacman gameboard controlled wirelessly by N64 controller. DC motors controlled via PWM verilog module; RGB sensor via I2C; photoresistors via ADC; N64 controller and LED grid via UART; and wireless communication via XBee. Game logic written in C using A* pathfinding algorithm. Implemented on SmartFusion SoC using Advanced Peripheral Bus, hardware timers, interrupts, and memory-mapped I/O to communicate between ARM Cortex M3, integrated FPGA, and peripherals.", "gitHubRepoName": ""}, {"title": "Simultaneous Localization and Mapping Robot", "url": "https://drive.google.com/drive/folders/17grbDyJVI5lJKkwWEvUcQP1EiyA9-lvp", "organization": "University of Michigan", "date": "2017", "cvparagraph": "Two-wheeled robot with lidar and odometry sensors capabable of exploring an unknown, obstacle-filled area using SLAM. Localization used particle filtering of Markov model of actions and sensors. Mapping and exploration employed occupancy grid based on lidar readings to detect frontiers of unknown space and navigate via A* path-finding algorithm.", "gitHubRepoName": ""}, {"title": "Tic-Tac-Toe Robot", "url": "https://drive.google.com/drive/folders/17dpGI2AZXLQeBZ3MueF8agzo8r2cehZu", "organization": "University of Michigan", "date": "2017", "cvparagraph": "Robot arm capable of playing tic-tac-toe with ping-pong balls using forward and inverse kinematics to achieve desired end effector position and OpenCV to detect ball locations via RGB-D camera.", "gitHubRepoName": ""}, {"title": "MIPS R10K Microprocessor", "url": "https://drive.google.com/drive/folders/17iu4ip747moZ4sQQZMi77J8Z0gzI8UFG", "organization": "University of Michigan", "date": "2016", "cvparagraph": "RISC microprocessor based on the MIPS R10K supporting two-way superscalar, out-of-order execution, Gshare branch prediction, and simultaneous multi-threading. Written in system verilog and synthesized via Synopsys VCS.", "gitHubRepoName": ""}, {"title": "Topological Mapping Robot", "url": "https://drive.google.com/drive/folders/17_EqmLftuGBope85FtokHQAA6ugtmVWc", "organization": "University of Michigan", "date": "2017", "cvparagraph": "Implemented an algorithm to build a topological map of a single-story building using lidar-based intersection and corridor detection in combination with simultaneous localization and mapping.", "gitHubRepoName": ""}, {"title": "astarc", "url": "https://github.com/brandonmosher/astarc", "organization": "", "date": "2020", "cvparagraph": "Templated A* algorithm written in C.", "gitHubRepoName": "brandonmosher/astarc"}, {"title": "pyctemp", "url": "https://github.com/brandonmosher/pyctemp", "organization": "", "date": "2020", "cvparagraph": "Python preprocessor to implement a limited subset of C++ template features in C.", "gitHubRepoName": "brandonmosher/pyctemp"}, {"title": "Devcontainer Base", "url": "https://github.com/brandonmosher/devcontainer-base", "organization": "", "date": "2020", "cvparagraph": "A ubuntu Docker image configured for interactive use suitable for a general-purpose development environment.", "gitHubRepoName": "brandonmosher/devcontainer-base"}]}, "hobbies": {"title": "Hobbies", "cventries": [{"title": "Music Performance and Recording", "cvparagraph": "Played rock and jazz drumset for over 20 years. Recorded full-length album for local band."}, {"title": "Renovation", "cvparagraph": "Rennovated two homes resulting in a 200% and 400% increase in value. respectively. Drew plans, made all material selections, and performed various rough and finish carpentry, electrical, and plumbing work."}]}}}}